#!/bin/bash

asd(){
echo "这是我人生中的第一个shell函数,今天是2025年11月10号,下午16:47,在宿舍."
}

echo "========函数开始调用========"
asd
echo "========函数调用完毕========"



add()
{
echo "这个函数将读取两个数,然后返回结果."
read -p "请输入第一个数:" num1
read -p "请输入第二个数:" num2
return $(($num1 + $num2))
}

add #这是函数的调用.

echo "计算的结果是$?"

echo "==========函数的参数========="
fate(){
echo "第一个参数:$1"
echo "第二个参数:$2"
echo "第三个参数:$3"
echo "第十个参数:$10"
echo "第十个参数是:${10}"
echo "第十一个参数是:${11}"
echo "所有的参数有$#个."
echo "作为一个字符串而输出所有参数: $* "
}
fate 12 32 6 8 9 321 654 888 654 1321      321 987 25 369 147
